In [3]:
import numpy as np
import pandas as pd

In [4]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -1.369755  0.773574  1.313106 -0.430790
2013-01-02 -0.516270 -1.317959  0.637439  0.581738
2013-01-03 -1.339589  2.098393  2.287790  0.073753
2013-01-04 -0.626374  0.923755 -1.036798 -1.271674
2013-01-05 -1.517542  0.439669 -0.426588  0.009118
2013-01-06 -0.560246 -0.150327 -1.359393 -0.499481

In [7]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [8]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [9]:
df.head()

                   A         B         C         D
2013-01-01 -1.369755  0.773574  1.313106 -0.430790
2013-01-02 -0.516270 -1.317959  0.637439  0.581738
2013-01-03 -1.339589  2.098393  2.287790  0.073753
2013-01-04 -0.626374  0.923755 -1.036798 -1.271674
2013-01-05 -1.517542  0.439669 -0.426588  0.009118

In [10]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.626374  0.923755 -1.036798 -1.271674
2013-01-05 -1.517542  0.439669 -0.426588  0.009118
2013-01-06 -0.560246 -0.150327 -1.359393 -0.499481

In [11]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [13]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [14]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [15]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.988296  0.461184  0.235926 -0.256223
std    0.466057  1.142958  1.423761  0.632812
min   -1.517542 -1.317959 -1.359393 -1.271674
25%   -1.362214 -0.002828 -0.884246 -0.482308
50%   -0.982981  0.606621  0.105425 -0.210836
75%   -0.576778  0.886210  1.144189  0.057594
max   -0.516270  2.098393  2.287790  0.581738

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.369755   -0.516270   -1.339589   -0.626374   -1.517542   -0.560246
B    0.773574   -1.317959    2.098393    0.923755    0.439669   -0.150327
C    1.313106    0.637439    2.287790   -1.036798   -0.426588   -1.359393
D   -0.430790    0.581738    0.073753   -1.271674    0.009118   -0.499481

In [17]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.430790  1.313106  0.773574 -1.369755
2013-01-02  0.581738  0.637439 -1.317959 -0.516270
2013-01-03  0.073753  2.287790  2.098393 -1.339589
2013-01-04 -1.271674 -1.036798  0.923755 -0.626374
2013-01-05  0.009118 -0.426588  0.439669 -1.517542
2013-01-06 -0.499481 -1.359393 -0.150327 -0.560246

In [18]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-02 -0.516270 -1.317959  0.637439  0.581738
2013-01-06 -0.560246 -0.150327 -1.359393 -0.499481
2013-01-05 -1.517542  0.439669 -0.426588  0.009118
2013-01-01 -1.369755  0.773574  1.313106 -0.430790
2013-01-04 -0.626374  0.923755 -1.036798 -1.271674
2013-01-03 -1.339589  2.098393  2.287790  0.073753

In [19]:
df["A"]

2013-01-01   -1.369755
2013-01-02   -0.516270
2013-01-03   -1.339589
2013-01-04   -0.626374
2013-01-05   -1.517542
2013-01-06   -0.560246
Freq: D, Name: A, dtype: float64

In [20]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.369755  0.773574  1.313106 -0.430790
2013-01-02 -0.516270 -1.317959  0.637439  0.581738
2013-01-03 -1.339589  2.098393  2.287790  0.073753

In [21]:
df.loc[dates[0]]

A   -1.369755
B    0.773574
C    1.313106
D   -0.430790
Name: 2013-01-01 00:00:00, dtype: float64

In [22]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -1.369755  0.773574
2013-01-02 -0.516270 -1.317959
2013-01-03 -1.339589  2.098393
2013-01-04 -0.626374  0.923755
2013-01-05 -1.517542  0.439669
2013-01-06 -0.560246 -0.150327

In [23]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.516270 -1.317959
2013-01-03 -1.339589  2.098393
2013-01-04 -0.626374  0.923755

In [24]:
df.loc[dates[0], "A"]

-1.369755385903434

In [25]:
df.at[dates[0], "A"]

-1.369755385903434

In [26]:
df.iloc[3]

A   -0.626374
B    0.923755
C   -1.036798
D   -1.271674
Name: 2013-01-04 00:00:00, dtype: float64

In [27]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.626374  0.923755
2013-01-05 -1.517542  0.439669

In [28]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.516270  0.637439
2013-01-03 -1.339589  2.287790
2013-01-05 -1.517542 -0.426588

In [29]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.516270 -1.317959  0.637439  0.581738
2013-01-03 -1.339589  2.098393  2.287790  0.073753

In [30]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.773574  1.313106
2013-01-02 -1.317959  0.637439
2013-01-03  2.098393  2.287790
2013-01-04  0.923755 -1.036798
2013-01-05  0.439669 -0.426588
2013-01-06 -0.150327 -1.359393

In [31]:
df.iloc[1, 1]

-1.317958662109844

In [32]:
df.iat[1, 1]

-1.317958662109844

In [33]:
df[df["A"] > 0]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [34]:
df[df > 0]

             A         B         C         D
2013-01-01 NaN  0.773574  1.313106       NaN
2013-01-02 NaN       NaN  0.637439  0.581738
2013-01-03 NaN  2.098393  2.287790  0.073753
2013-01-04 NaN  0.923755       NaN       NaN
2013-01-05 NaN  0.439669       NaN  0.009118
2013-01-06 NaN       NaN       NaN       NaN

In [35]:
df2 = df.copy()

In [36]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [37]:
df2

                   A         B         C         D      E
2013-01-01 -1.369755  0.773574  1.313106 -0.430790    one
2013-01-02 -0.516270 -1.317959  0.637439  0.581738    one
2013-01-03 -1.339589  2.098393  2.287790  0.073753    two
2013-01-04 -0.626374  0.923755 -1.036798 -1.271674  three
2013-01-05 -1.517542  0.439669 -0.426588  0.009118   four
2013-01-06 -0.560246 -0.150327 -1.359393 -0.499481  three

In [38]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [39]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [40]:
df["F"] = s1

In [41]:
df.at[dates[0], "A"] = 0

In [42]:
df.iat[0, 1] = 0

In [43]:
df.loc[:, "D"] = np.array([5] * len(df))

In [44]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  1.313106  5.0  NaN
2013-01-02 -0.516270 -1.317959  0.637439  5.0  1.0
2013-01-03 -1.339589  2.098393  2.287790  5.0  2.0
2013-01-04 -0.626374  0.923755 -1.036798  5.0  3.0
2013-01-05 -1.517542  0.439669 -0.426588  5.0  4.0
2013-01-06 -0.560246 -0.150327 -1.359393  5.0  5.0

In [45]:
df2 = df.copy()

In [46]:
df2[df2 > 0] = -df2

In [47]:
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.313106 -5.0  NaN
2013-01-02 -0.516270 -1.317959 -0.637439 -5.0 -1.0
2013-01-03 -1.339589 -2.098393 -2.287790 -5.0 -2.0
2013-01-04 -0.626374 -0.923755 -1.036798 -5.0 -3.0
2013-01-05 -1.517542 -0.439669 -0.426588 -5.0 -4.0
2013-01-06 -0.560246 -0.150327 -1.359393 -5.0 -5.0

In [48]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [49]:
df1.loc[dates[0] : dates[1], "E"] = 1

In [50]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  1.313106  5.0  NaN  1.0
2013-01-02 -0.516270 -1.317959  0.637439  5.0  1.0  1.0
2013-01-03 -1.339589  2.098393  2.287790  5.0  2.0  NaN
2013-01-04 -0.626374  0.923755 -1.036798  5.0  3.0  NaN

In [51]:
df1.dropna(how="any")

                  A         B         C    D    F    E
2013-01-02 -0.51627 -1.317959  0.637439  5.0  1.0  1.0

In [52]:
df1.fillna(value=5)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  1.313106  5.0  5.0  1.0
2013-01-02 -0.516270 -1.317959  0.637439  5.0  1.0  1.0
2013-01-03 -1.339589  2.098393  2.287790  5.0  2.0  5.0
2013-01-04 -0.626374  0.923755 -1.036798  5.0  3.0  5.0

In [53]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [54]:
df.mean()

A   -0.760003
B    0.332255
C    0.235926
D    5.000000
F    3.000000
dtype: float64

In [55]:
df.mean(axis=1)

2013-01-01    1.578277
2013-01-02    0.960642
2013-01-03    2.009319
2013-01-04    1.452117
2013-01-05    1.499108
2013-01-06    1.586007
Freq: D, dtype: float64

In [56]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [57]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [58]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -2.339589  1.098393  1.287790  4.0  1.0
2013-01-04 -3.626374 -2.076245 -4.036798  2.0  0.0
2013-01-05 -6.517542 -4.560331 -5.426588  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [59]:
df.agg(lambda x: np.mean(x) * 5.6)

A    -4.256020
B     1.860629
C     1.321185
D    28.000000
F    16.800000
dtype: float64

In [60]:
df.transform(lambda x: x * 101.2)

                     A           B           C      D      F
2013-01-01    0.000000    0.000000  132.886357  506.0    NaN
2013-01-02  -52.246511 -133.377417   64.508814  506.0  101.2
2013-01-03 -135.566440  212.357362  231.524369  506.0  202.4
2013-01-04  -63.389004   93.483993 -104.923951  506.0  303.6
2013-01-05 -153.575291   44.494462  -43.170727  506.0  404.8
2013-01-06  -56.696871  -15.213044 -137.570610  506.0  506.0

In [61]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [62]:
s

0    5
1    6
2    3
3    1
4    5
5    0
6    4
7    6
8    5
9    1
dtype: int32

In [63]:
s.value_counts()

5    3
6    2
1    2
3    1
0    1
4    1
Name: count, dtype: int64

In [64]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [65]:
s

0    4
1    1
2    1
3    3
4    0
5    1
6    1
7    4
8    3
9    0
dtype: int32

In [66]:
s.value_counts()

1    4
4    2
3    2
0    2
Name: count, dtype: int64

In [67]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])

In [68]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [69]:
df = pd.DataFrame(np.random.randn(10, 4))

In [70]:
df

          0         1         2         3
0 -0.316179 -0.645790  0.489539 -0.978209
1  1.330637 -0.419831 -1.036273 -2.021464
2 -0.931592 -1.767964 -0.925443  0.308054
3  0.769294  2.620712 -0.863739 -1.089799
4  1.938587  1.267341 -0.416463  0.625482
5  1.112212 -0.150135  1.331682  0.034716
6 -0.608355 -0.133563 -1.265480  0.678182
7 -0.647163  0.310048 -0.900801 -0.804403
8  0.131922 -0.089069 -0.875691 -1.481393
9 -0.265746 -0.329878  0.315263  0.067259

In [71]:
# break it into pieces
pieces = [df[:3], df[3:7], df[7:]]

In [72]:
pd.concat(pieces)

          0         1         2         3
0 -0.316179 -0.645790  0.489539 -0.978209
1  1.330637 -0.419831 -1.036273 -2.021464
2 -0.931592 -1.767964 -0.925443  0.308054
3  0.769294  2.620712 -0.863739 -1.089799
4  1.938587  1.267341 -0.416463  0.625482
5  1.112212 -0.150135  1.331682  0.034716
6 -0.608355 -0.133563 -1.265480  0.678182
7 -0.647163  0.310048 -0.900801 -0.804403
8  0.131922 -0.089069 -0.875691 -1.481393
9 -0.265746 -0.329878  0.315263  0.067259

In [73]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})

In [74]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [75]:
left

   key  lval
0  foo     1
1  foo     2

In [76]:
right

   key  rval
0  foo     4
1  foo     5

In [77]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [78]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})

In [79]:
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

In [80]:
left

   key  lval
0  foo     1
1  bar     2

In [81]:
right

   key  rval
0  foo     4
1  bar     5

In [82]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [83]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

In [84]:
df

     A      B         C         D
0  foo    one -0.138934  0.415891
1  bar    one  1.349478  0.142768
2  foo    two  1.036623 -0.168201
3  bar  three -0.009214  0.104236
4  foo    two  0.490034  0.169224
5  bar    two  0.481980  0.474981
6  foo    one  0.607806  0.544026
7  foo  three -1.193912 -0.401686

In [85]:
df.groupby("A")[["C", "D"]].sum()

            C         D
A
bar  1.822244  0.721985
foo  0.801617  0.559254

In [86]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one    1.349478  0.142768
    three -0.009214  0.104236
    two    0.481980  0.474981
foo one    0.468872  0.959917
    three -1.193912 -0.401686
    two    1.526657  0.001023

In [87]:
arrays = [
   ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ["one", "two", "one", "two", "one", "two", "one", "two"],
]

In [88]:
index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])

In [89]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])

In [90]:
df2 = df[:4]

In [91]:
df2

                     A         B
first second
bar   one     1.206206 -0.397181
      two     0.699908 -0.710063
baz   one     0.740714 -2.199878
      two    -0.862014 -2.417439

In [92]:
stacked = df2.stack(future_stack=True)

In [93]:
stacked

first  second
bar    one     A    1.206206
               B   -0.397181
       two     A    0.699908
               B   -0.710063
baz    one     A    0.740714
               B   -2.199878
       two     A   -0.862014
               B   -2.417439
dtype: float64

In [94]:
stacked.unstack()

                     A         B
first second
bar   one     1.206206 -0.397181
      two     0.699908 -0.710063
baz   one     0.740714 -2.199878
      two    -0.862014 -2.417439

In [95]:
stacked.unstack(1)

second        one       two
first
bar   A  1.206206  0.699908
      B -0.397181 -0.710063
baz   A  0.740714 -0.862014
      B -2.199878 -2.417439

In [96]:
stacked.unstack(0)

first          bar       baz
second
one    A  1.206206  0.740714
       B -0.397181 -2.199878
two    A  0.699908 -0.862014
       B -0.710063 -2.417439

In [97]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)

In [98]:
df

        A  B    C         D         E
0     one  A  foo -0.823593  0.742494
1     one  B  foo  1.439617  0.138825
2     two  C  foo  0.017203 -2.155350
3   three  A  bar  0.683402 -1.400560
4     one  B  bar -0.225840  2.114665
5     one  C  bar  0.577576 -0.141556
6     two  A  foo -1.634577 -1.341480
7   three  B  foo -0.054718 -1.065314
8     one  C  foo  0.299925  2.494783
9     one  A  bar -1.108719 -1.750895
10    two  B  bar  0.144034 -0.387770
11  three  C  bar  0.112214 -1.019968

In [99]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A -1.108719 -0.823593
      B -0.225840  1.439617
      C  0.577576  0.299925
three A  0.683402       NaN
      B       NaN -0.054718
      C  0.112214       NaN
two   A       NaN -1.634577
      B  0.144034       NaN
      C       NaN  0.017203

In [100]:
rng = pd.date_range("1/1/2012", periods=100, freq="s")

In [101]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [102]:
ts.resample("5Min").sum()

2012-01-01    25008
Freq: 5T, dtype: int32

In [103]:
rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")

In [104]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [105]:
ts

2012-03-06   -0.327936
2012-03-07    0.882426
2012-03-08    0.206263
2012-03-09   -0.250330
2012-03-10    0.421070
Freq: D, dtype: float64

In [106]:
ts_utc = ts.tz_localize("UTC")

In [107]:
ts_utc

2012-03-06 00:00:00+00:00   -0.327936
2012-03-07 00:00:00+00:00    0.882426
2012-03-08 00:00:00+00:00    0.206263
2012-03-09 00:00:00+00:00   -0.250330
2012-03-10 00:00:00+00:00    0.421070
Freq: D, dtype: float64

In [108]:
ts_utc.tz_convert("US/Eastern")

2012-03-05 19:00:00-05:00   -0.327936
2012-03-06 19:00:00-05:00    0.882426
2012-03-07 19:00:00-05:00    0.206263
2012-03-08 19:00:00-05:00   -0.250330
2012-03-09 19:00:00-05:00    0.421070
Freq: D, dtype: float64

In [109]:
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [110]:
rng + pd.offsets.BusinessDay(5)

DatetimeIndex(['2012-03-13', '2012-03-14', '2012-03-15', '2012-03-16',
               '2012-03-16'],
              dtype='datetime64[ns]', freq=None)